In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  0.717811  0.878076  0.761759  0.884352
B  0.081869  0.740726  0.149954  0.185115
C  0.365094  0.566710  0.369825  0.486091
D  0.639443  0.644257  0.774287  0.783134
E  0.990487  0.539483  0.607152  0.161975

In [5]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.717811  0.878076  0.761759  0.884352
1     B  0.081869  0.740726  0.149954  0.185115
2     C  0.365094  0.566710  0.369825  0.486091
3     D  0.639443  0.644257  0.774287  0.783134
4     E  0.990487  0.539483  0.607152  0.161975

In [6]:
df['kode'] = 'ID IN JP RU US'.split()

In [7]:
df

          W         X         Y         Z kode
A  0.717811  0.878076  0.761759  0.884352   ID
B  0.081869  0.740726  0.149954  0.185115   IN
C  0.365094  0.566710  0.369825  0.486091   JP
D  0.639443  0.644257  0.774287  0.783134   RU
E  0.990487  0.539483  0.607152  0.161975   US

In [8]:
df.set_index('kode')

             W         X         Y         Z
kode
ID    0.717811  0.878076  0.761759  0.884352
IN    0.081869  0.740726  0.149954  0.185115
JP    0.365094  0.566710  0.369825  0.486091
RU    0.639443  0.644257  0.774287  0.783134
US    0.990487  0.539483  0.607152  0.161975

In [9]:
df

          W         X         Y         Z kode
A  0.717811  0.878076  0.761759  0.884352   ID
B  0.081869  0.740726  0.149954  0.185115   IN
C  0.365094  0.566710  0.369825  0.486091   JP
D  0.639443  0.644257  0.774287  0.783134   RU
E  0.990487  0.539483  0.607152  0.161975   US

In [10]:
df.set_index('kode', inplace=True)

In [11]:
df

             W         X         Y         Z
kode
ID    0.717811  0.878076  0.761759  0.884352
IN    0.081869  0.740726  0.149954  0.185115
JP    0.365094  0.566710  0.369825  0.486091
RU    0.639443  0.644257  0.774287  0.783134
US    0.990487  0.539483  0.607152  0.161975

In [14]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))

data = pd.MultiIndex.from_tuples(data)

In [15]:
zip(dataLabels,dataValue)

In [16]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [17]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [18]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])

In [19]:
df

             A         B
G1 1 -0.485997 -0.041314
   2  0.957671  1.178152
   3  0.580161 -0.920070
G2 1  0.442693 -0.276339
   2 -0.300295  0.540139
   3 -1.404226  0.939325

In [20]:
df.loc['G1']

          A         B
1 -0.485997 -0.041314
2  0.957671  1.178152
3  0.580161 -0.920070

In [21]:
df.loc['G1'].loc[3]

A    0.580161
B   -0.920070
Name: 3, dtype: float64

In [22]:
df.index.names
df.index.names = ['Group','No']

In [23]:
df

                 A         B
Group No
G1    1  -0.485997 -0.041314
      2   0.957671  1.178152
      3   0.580161 -0.920070
G2    1   0.442693 -0.276339
      2  -0.300295  0.540139
      3  -1.404226  0.939325

In [24]:
df.xs('G1')

           A         B
No
1  -0.485997 -0.041314
2   0.957671  1.178152
3   0.580161 -0.920070

In [25]:
df.xs(['G2',2])

A   -0.300295
B    0.540139
Name: (G2, 2), dtype: float64

In [26]:
df.xs(1,level='No')

              A         B
Group
G1    -0.485997 -0.041314
G2     0.442693 -0.276339